cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'd12frosted/emacs-plus'
tap 'homebrew/bundle'
tap 'borkdude/brew'

# Dependency for sbt and scala
cask 'java8'

brew 'bash-completion'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/jet'
brew 'clojure'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'github/gh/gh'
brew 'httpie'
brew 'jq'
brew 'leiningen'
brew 'libyaml'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'readline'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vault'
brew 'wget'
brew 'zsh'

cask 'emacs-plus'
cask 'firefox'
cask 'flycut'
cask 'font-source-code-pro'
cask 'intellij-idea'
cask 'iterm2'
cask 'google-chrome'
cask 'kap'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
