cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Dependency for sbt and scala
cask 'java8'

brew 'clojure'
brew 'coreutils'
brew 'git'
brew 'git-completion'
brew 'httpie'
brew 'jq'
brew 'leiningen'
brew 'libyaml'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'readline'
brew 'the_silver_searcher'
brew 'tmux'

cask 'firefox'
cask 'flycut'
cask 'intellij-idea'
cask 'iterm2'
cask 'google-chrome'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
