cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'borkdude/brew'

brew 'bash-completion'
brew 'bat'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/jet'
brew 'clojure'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'httpie'
brew 'jq'
brew 'leiningen'
brew 'libyaml'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'readline'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'vault'
brew 'wget'
brew 'xsv'
brew 'zsh'

cask 'cljstyle'
cask 'firefox'
cask 'flycut'
cask 'font-source-code-pro'
cask 'iterm2'
cask 'google-chrome'
cask 'kap'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
